(gdb) b main
Breakpoint 1 at 0x772: file p0original.c, line 3.
(gdb) r
Starting program: /home/runner/pps-test1-Shashank1726/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p0original.c:3
3   {
(gdb) n
5     printf("Enter your name\n");
(gdb) n
Enter your name
6     scanf("%s",a);
(gdb) n
Shashank
7     printf("%s",a);
(gdb) n
8     return 0;
(gdb) c
Continuing.
Shashank[Inferior 1 (process 156) exited normally]
(gdb) q
